meshtastic/firmware/src/platform/nrf52/NRF52BLEGattMesh.cpp
#include "configuration.h"

#if HAS_BLE_GATT_MESH && defined(ARCH_NRF52)

#include "NRF52BLEGattMesh.h"
#include "NRF52Bluetooth.h"
#include "concurrency/Lock.h"
#include "concurrency/LockGuard.h"
#include "main.h"
#include "mesh/Throttle.h"
#include <array>
#include <bluefruit.h>
#include <utility/bonding.h>

namespace
{
// Shared between Bluefruit's callback task and the main task (the pump).
concurrency::Lock lock;

struct Link {
    bool used;
    uint16_t conn;
    bool subscribed;     // wrote the CCCD: a notify target, and the mark of a mesh peer
    bool everSubscribed; // subscribed at any point, which outlives an unsubscribe
    bool outbound;       // this node dialled it: frames go out as GATT client writes, not notifies
};
std::array<Link, 4> links{};

struct RxChunk {
    uint16_t conn;
    uint16_t len; // 0 marks a disconnect
    uint8_t data[BLE_GATT_MESH_MAX_CHUNK];
};
std::array<RxChunk, BLE_GATT_MESH_RX_QUEUE_SIZE> rxQueue{};
size_t rxHead = 0;
size_t rxTail = 0;
size_t rxCount = 0;
bool serviceReady = false;

// BLE_GATT_MESH_SERVICE_UUID / _CHARACTERISTIC_UUID as the SoftDevice wants them: little-endian.
const uint8_t serviceUuid[16] = {0x01, 0x00, 0x00, 0x00, 0x54, 0x54, 0x41, 0x47, 0x65, 0x64, 0x6f, 0x4e, 0x68, 0x73, 0x65, 0x4d};
const uint8_t characteristicUuid[16] = {0x02, 0x00, 0x00, 0x00, 0x54, 0x54, 0x41, 0x47,
                                        0x65, 0x64, 0x6f, 0x4e, 0x68, 0x73, 0x65, 0x4d};
BLEService meshPeerService = BLEService(BLEUuid(serviceUuid));
BLECharacteristic meshPeerCharacteristic = BLECharacteristic(BLEUuid(characteristicUuid));

// The negotiated MTU is read live: Bluefruit exposes no MTU-changed callback.
uint16_t chunkFor(uint16_t conn)
{
    BLEConnection *c = Bluefruit.Connection(conn);
    const uint16_t mtu = c ? c->getMtu() : 0;
    return mtu > 3 ? mtu - 3 : BLE_GATT_MESH_MIN_CHUNK;
}

// Callers hold `lock` for everything below this line.
Link *findLink(uint16_t conn)
{
    for (auto &l : links) {
        if (l.used && l.conn == conn)
            return &l;
    }
    return nullptr;
}

Link *addLink(uint16_t conn)
{
    if (Link *l = findLink(conn))
        return l;
    for (auto &l : links) {
        if (l.used)
            continue;
        l.used = true;
        l.conn = conn;
        l.subscribed = false;
        l.everSubscribed = false;
        l.outbound = false;
        return &l;
    }
    return nullptr;
}

// Counted since boot so a dropped write carries its own denominator: the log reaches a host as a
// sparse LogRecord stream, and one surviving line has to be enough to compute a rate from.
uint32_t rxArrived = 0;
uint32_t rxAccepted = 0;
uint32_t rxDropped = 0;

void pushRx(uint16_t conn, const uint8_t *data, uint16_t len)
{
    if (rxCount >= rxQueue.size()) {
        if (len) {
            rxDropped++;
            LOG_WARN("BLE GATT mesh: RX queue full, dropping a %u-byte write from conn %u (accepted %u, dropped %u)", len, conn,
                     (unsigned)rxAccepted, (unsigned)rxDropped);
            return;
        }
        // A disconnect marker must land or the pump keeps that handle's half-built packets for the
        // next peer the stack gives it: overwrite the newest chunk, which belongs to a dead link anyway.
        rxTail = (rxTail + rxQueue.size() - 1) % rxQueue.size();
        rxCount--;
    }
    RxChunk &r = rxQueue[rxTail];
    r.conn = conn;
    r.len = len;
    if (len)
        memcpy(r.data, data, len);
    rxTail = (rxTail + 1) % rxQueue.size();
    rxCount++;
    if (len)
        rxAccepted++;
}

void onWrite(uint16_t conn, BLECharacteristic *, uint8_t *data, uint16_t len)
{
    // Bluefruit's callback task: copy the value out and wake the pump. Nothing here touches the mesh.
    if (len == 0 || len > BLE_GATT_MESH_MAX_CHUNK) {
        LOG_WARN("BLE GATT mesh: write from conn %u refused at the door, %u bytes", conn, len);
        return;
    }
    {
        concurrency::LockGuard guard(&lock);
        addLink(conn);
        pushRx(conn, data, len);
    }
    // After the lock, never inside it: a LOG_ that takes one deadlocks against this same mutex.
    // Every arrival is logged because the question this answers is whether writes reach the door at
    // all - pushRx speaks only when it turns one away.
    rxArrived++;
    LOG_DEBUG("BLE GATT mesh: write %u bytes from conn %u (arrived %u, accepted %u, dropped %u)", len, conn, (unsigned)rxArrived,
              (unsigned)rxAccepted, (unsigned)rxDropped);
    if (bleGattMeshHandler)
        bleGattMeshHandler->wake();
}

void onCccd(uint16_t conn, BLECharacteristic *, uint16_t value)
{
    // The canonical "this link is a mesh peer" signal: a CCCD write enabling notifications. Only a
    // subscribed link is a notify target, so a plain phone-API client is never sent mesh frames.
    const bool subscribed = (value & 0x0001) != 0;
    {
        concurrency::LockGuard guard(&lock);
        if (Link *l = addLink(conn)) {
            l->subscribed = subscribed;
            l->everSubscribed |= subscribed;
        }
    }
    LOG_INFO("BLE GATT mesh: conn %u %s (chunk %u)", conn, subscribed ? "subscribed" : "unsubscribed", chunkFor(conn));
    if (bleGattMeshHandler)
        bleGattMeshHandler->wake();
}

#if BLE_GATT_MESH_DIAL
// The outbound half: this node as the central, on the one central link Bluefruit.begin(2, 1) configures.
BLEClientService meshClientService = BLEClientService(BLEUuid(serviceUuid));
BLEClientCharacteristic meshClientCharacteristic = BLEClientCharacteristic(BLEUuid(characteristicUuid));
bool dialing = false;
ble_gap_addr_t dialAddr{};
// A peer that dropped, refused or never answered is not redialled for a minute: the scanner reports
// it again within 100 ms. One length for every outcome, on purpose. An iPhone that reached this node
// by itself keeps advertising the overflow bit under an address it rotates, and the dial of that
// address is refused (0x3e) every time - so a dual-role iPhone in range costs one refused dial a
// minute, about a second of scan each. A longer wait after 0x3e would spare that and instead make a
// backgrounded iPhone that hit a transient refusal (a reflash race, an app relaunch) unreachable for
// that long, which is the worse trade for a mesh. Telling the two apart needs identity, not address.
#ifndef BLE_GATT_MESH_DIAL_COOLDOWN_MS
#define BLE_GATT_MESH_DIAL_COOLDOWN_MS 60000
#endif
// How long a dial may wait for the peer to accept the connection. Bluefruit's own default is forever.
#ifndef BLE_GATT_MESH_DIAL_TIMEOUT_MS
#define BLE_GATT_MESH_DIAL_TIMEOUT_MS 4000
#endif
bool cooldownArmed = false;
ble_gap_addr_t cooldownAddr{};
uint32_t cooldownSinceMs = 0;

// The proof-of-life write request in flight on the dialled link, and how it ended. Bluefruit's own
// write_resp() gives the peer 100 ms, which a backgrounded iPhone on a long connection interval
// misses while still answering every time; this waits a few intervals and reads the response event
// through the mesh's event tap instead.
#ifndef BLE_GATT_MESH_PROBE_WAIT_MS
#define BLE_GATT_MESH_PROBE_WAIT_MS 1500
#endif
enum ProbeState : uint8_t { PROBE_IDLE, PROBE_PENDING, PROBE_ANSWERED, PROBE_REFUSED };
volatile uint16_t probeConn = BLE_CONN_HANDLE_INVALID;
volatile uint8_t probeState = PROBE_IDLE;

