meshtastic/firmware/src/platform/nrf52/NRF52BLEGattMesh.cpp
void armCooldown()
{
    cooldownAddr = dialAddr;
    cooldownSinceMs = millis();
    cooldownArmed = true;
    dialing = false;
}

void onNotify(BLEClientCharacteristic *chr, uint8_t *data, uint16_t len)
{
    const uint16_t conn = chr->connHandle();
    if (len == 0 || len > BLE_GATT_MESH_MAX_CHUNK)
        return;
    {
        concurrency::LockGuard guard(&lock);
        pushRx(conn, data, len);
    }
    rxArrived++;
    if (bleGattMeshHandler)
        bleGattMeshHandler->wake();
}

void onCentralConnect(uint16_t conn)
{
    // `dialing` stays set until this settles: the scanner is back on and would dial again in the gap.
    // Discovery blocks; this runs on Bluefruit's callback task, never the SoftDevice's event path.
    // The SoftDevice runs one GATTC procedure per link at a time, so the MTU exchange comes last.
    const char *failed = nullptr;
    if (!Bluefruit.connected(conn))
        failed = "link gone before discovery";
    else if (!meshClientService.discover(conn))
        failed = "service not found";
    else if (!meshClientCharacteristic.discover())
        failed = "characteristic not found";
    else if (!meshClientCharacteristic.enableNotify())
        failed = "CCCD write refused";
    if (failed) {
        LOG_WARN("BLE GATT mesh: dialled conn %u dropped: %s", conn, failed);
        armCooldown();
        Bluefruit.disconnect(conn);
        return;
    }
    {
        concurrency::LockGuard guard(&lock);
        if (Link *l = addLink(conn)) {
            l->outbound = true;
            l->subscribed = true;
            l->everSubscribed = true;
        }
    }
    dialing = false;
    // 247 is what configCentralBandwidth(BANDWIDTH_MAX) allows; asking for more is refused and leaves 23.
    if (BLEConnection *c = Bluefruit.Connection(conn))
        c->requestMtuExchange(247);
    LOG_INFO("BLE GATT mesh: dialled conn %u is a mesh peer (chunk %u)", conn, chunkFor(conn));
    if (bleGattMeshHandler)
        bleGattMeshHandler->wake();
}

void onCentralDisconnect(uint16_t conn, uint8_t reason)
{
    {
        concurrency::LockGuard guard(&lock);
        if (Link *l = findLink(conn)) {
            l->used = false;
            pushRx(conn, nullptr, 0);
        }
    }
    armCooldown();
    LOG_INFO("BLE GATT mesh: dialled conn %u disconnected (reason 0x%02x)", conn, reason);
    if (bleGattMeshHandler)
        bleGattMeshHandler->wake();
}
#endif // BLE_GATT_MESH_DIAL
} // namespace

void NRF52BLEGattMesh::setupService()
{
    // Deliberately no encryption or pairing requirement: a mesh peer is a stranger by design, exactly
    // as on LoRa, and the channel PSK is the security. The client library does not pair.
    meshPeerService.setPermission(SECMODE_OPEN, SECMODE_OPEN);
    meshPeerService.begin();
    meshPeerCharacteristic.setProperties(CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP | CHR_PROPS_NOTIFY);
    meshPeerCharacteristic.setPermission(SECMODE_OPEN, SECMODE_OPEN);
    meshPeerCharacteristic.setFixedLen(0);
    meshPeerCharacteristic.setMaxLen(BLE_GATT_MESH_MAX_CHUNK);
    meshPeerCharacteristic.setWriteCallback(onWrite, true);
    meshPeerCharacteristic.setCccdWriteCallback(onCccd, true);
    meshPeerCharacteristic.begin();
#if BLE_GATT_MESH_DIAL
    static bool clientReady = false;
    if (!clientReady) {
        clientReady = true;
        meshClientService.begin();
        meshClientCharacteristic.begin();
        meshClientCharacteristic.setNotifyCallback(onNotify);
        Bluefruit.Central.setConnectCallback(onCentralConnect);
        Bluefruit.Central.setDisconnectCallback(onCentralDisconnect);
        // Bluefruit dials with its scanner's parameters, whose timeout is 0: a peer that never accepts
        // leaves the dial pending forever and this node never dials again.
        Bluefruit.Scanner.getParams()->timeout = BLE_GATT_MESH_DIAL_TIMEOUT_MS / 10;
    }
#endif
    {
        concurrency::LockGuard guard(&lock);
        for (auto &l : links)
            l.used = false;
        rxHead = rxTail = rxCount = 0;
        serviceReady = true;
    }
    LOG_INFO("BLE GATT mesh: mesh-peer service registered");
}

bool NRF52BLEGattMesh::addToScanResponse()
{
    if (!(config.network.enabled_protocols & meshtastic_Config_NetworkConfig_ProtocolFlags_BLE_GATT_PEER))
        return false;
    // 18 of the scan response's 31 bytes; the name that follows is shortened to what is left.
    Bluefruit.ScanResponse.addService(meshPeerService);
    LOG_INFO("BLE GATT mesh: advertising the mesh-peer service in the scan response");
    return true;
}

void NRF52BLEGattMesh::rearmAdvertising()
{
    // Bluefruit stops the connectable advertisement on connect and restarts it only when no peripheral
    // link is left, so with the phone and a peer sharing the radio the free slot would otherwise go
    // unadvertised. Bluefruit's own connect/disconnect handling ran synchronously before the deferred
    // callbacks this is reached from.
    if ((config.network.enabled_protocols & meshtastic_Config_NetworkConfig_ProtocolFlags_BLE_GATT_PEER) &&
        Bluefruit.Periph.connected() < 2 && !Bluefruit.Advertising.isRunning())
        Bluefruit.Advertising.start(0);
}

// An iOS app in the background advertises none of its service UUIDs. iOS moves them into Apple's
// "overflow area": manufacturer data for company 0x004c, type 0x01, then a 128-bit bitmap with one bit
// set per service, the bit chosen by an undocumented hash of the UUID. The bit for the mesh-peer
// service was measured on 2026-09-19 (iPadOS 26.6, BlueZ witness on james-pc): byte 1, mask 0x40 -
// the same frame foreground and background, with the UUID beside it only in the foreground. Any
// service that hashes to the same bit is a false positive, which the dial pays for with one connect:
// the service discovery that follows finds no mesh-peer service and drops the link.
//
// The overflow area rides in the SCAN RESPONSE, never the ADV_IND - this node's own passive scan
// received 1,500 Apple entries in a minute and not one of type 0x01, then saw it on the first scan
// response once the scan went active (NRF52BLEMesh.cpp). Proven the same day: a RAK4631 dialled a
// backgrounded, peripheral-only iPad off one such response, both HELLOs crossed, and a 127-byte
// text landed on the iPad in one write.
#define BLE_GATT_MESH_IOS_OVERFLOW_BYTE 1
#define BLE_GATT_MESH_IOS_OVERFLOW_MASK 0x40

static bool reportHasIosOverflowBit(const ble_gap_evt_adv_report_t *report)
{
    uint8_t mfr[31];
    const uint8_t len = Bluefruit.Scanner.parseReportByType(report, BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA, mfr, sizeof(mfr));
    // company id (2, little endian), overflow type (1), bitmap (16)
    if (len != 19 || mfr[0] != 0x4c || mfr[1] != 0x00 || mfr[2] != 0x01)
        return false;
    return (mfr[3 + BLE_GATT_MESH_IOS_OVERFLOW_BYTE] & BLE_GATT_MESH_IOS_OVERFLOW_MASK) != 0;
}

void NRF52BLEGattMesh::onScanReport(const ble_gap_evt_adv_report_t *report)
{
#if BLE_GATT_MESH_DIAL
    if (!report || !(config.network.enabled_protocols & meshtastic_Config_NetworkConfig_ProtocolFlags_BLE_GATT_PEER))
        return;
    // A scan-response report carries the advertiser's connectable bit too (every overflow response
    // logged on 2026-09-19 read conn=1 rsp=1), so this one gate covers both the ADV_IND and the
    // response, and a scannable-but-not-connectable advertiser is never dialled.
    if (!report->type.connectable || dialing || Bluefruit.Central.connected() > 0)
        return;
    // A controller holds one link per peer address, so a peer already connected the other way - a
    // phone that dialled this node first - cannot be dialled: the CONNECT_IND is ignored and the
    // attempt ends in 0x3e. The dial is for the peer that cannot dial, an iPhone in the background.
    for (uint16_t c = 0; c < BLE_MAX_CONNECTION; c++) {
        BLEConnection *bc = Bluefruit.Connection(c);
        if (!bc || !bc->connected())
            continue;
        const ble_gap_addr_t peer = bc->getPeerAddr();
        if (peer.addr_type == report->peer_addr.addr_type && memcmp(peer.addr, report->peer_addr.addr, sizeof(peer.addr)) == 0)
            return;
    }
    if (cooldownArmed && memcmp(&cooldownAddr, &report->peer_addr, sizeof(cooldownAddr)) == 0 &&
        Throttle::isWithinTimespanMs(cooldownSinceMs, BLE_GATT_MESH_DIAL_COOLDOWN_MS))
        return;
        // Only the primary advertisement is seen: the mesh scan is passive, so a node that puts the UUID in
        // its scan response (this firmware on nRF52) is never dialled. Phones put it in the advertisement.
        // The dial is for the peer that cannot dial: an iOS app in the background, which always carries the
        // overflow bit (in the foreground too). An advertiser showing the UUID alone is Android or another
        // radio, and both reach this node by themselves - dialling one of those spent the single central
        // slot on the phone that was about to connect anyway, then redialled its rotated address for ever.
#if BLE_GATT_MESH_DIAL_UUID
    if (!Bluefruit.Scanner.checkReportForUuid(report, BLEUuid(serviceUuid)) && !reportHasIosOverflowBit(report))
        return;
#else
    if (!reportHasIosOverflowBit(report))
        return;
#endif
    dialing = true;
    dialAddr = report->peer_addr;
    if (!Bluefruit.Central.connect(report)) {
        LOG_WARN("BLE GATT mesh: dial refused by the SoftDevice");
        armCooldown();
        return;
    }
    const uint8_t *a = report->peer_addr.addr;
    LOG_INFO("BLE GATT mesh: dialling %02x:%02x:%02x:%02x:%02x:%02x (rssi %d)", a[5], a[4], a[3], a[2], a[1], a[0], report->rssi);
#else
    (void)report;
#endif
}

