meshtastic/firmware/src/platform/nrf52/NRF52BLEGattMesh.cpp
void NRF52BLEGattMesh::onDialTimeout()
{
#if BLE_GATT_MESH_DIAL
    if (!dialing)
        return;
    LOG_INFO("BLE GATT mesh: dial timed out");
    armCooldown();
#endif
}

void NRF52BLEGattMesh::onConnect(uint16_t conn)
{
    {
        concurrency::LockGuard guard(&lock);
        addLink(conn);
    }
    rearmAdvertising();
}

bool NRF52BLEGattMesh::onDisconnect(uint16_t conn)
{
    bool subscribed = false;
    {
        concurrency::LockGuard guard(&lock);
        if (Link *l = findLink(conn)) {
            subscribed = l->everSubscribed;
            l->used = false;
            pushRx(conn, nullptr, 0); // the pump drops its half-built packets
        }
    }
    LOG_INFO("BLE GATT mesh: conn %u disconnected (%s)", conn, subscribed ? "was a mesh peer" : "never subscribed");
    if (bleGattMeshHandler)
        bleGattMeshHandler->wake();
    // Bluefruit's restartOnDisconnect only fires when no peripheral link is left; with one still up,
    // whoever just dropped could never come back without this.
    rearmAdvertising();
    return subscribed;
}

void NRF52BLEGattMesh::start()
{
    if (isRunning)
        return;
    isRunning = true;
    LOG_INFO("BLE GATT mesh started (waiting for Bluetooth ready)");
}

void NRF52BLEGattMesh::stop()
{
    if (!isRunning)
        return;
    isRunning = false;
    LOG_INFO("BLE GATT mesh stopped");
}

bool NRF52BLEGattMesh::platformReady()
{
    concurrency::LockGuard guard(&lock);
    return serviceReady && nrf52BluetoothReady;
}

size_t NRF52BLEGattMesh::platformPeers(BLEGattMeshPeer *out, size_t cap)
{
    concurrency::LockGuard guard(&lock);
    size_t n = 0;
    for (const auto &l : links) {
        if (!l.used || !l.subscribed)
            continue;
        if (n >= cap)
            break;
        out[n].id = l.conn;
        out[n].chunk = chunkFor(l.conn);
        out[n].outbound = l.outbound;
        n++;
    }
    return n;
}

bool NRF52BLEGattMesh::platformNotify(BLEGattPeerId peer, const uint8_t *data, size_t len)
{
#if BLE_GATT_MESH_DIAL
    bool outbound = false;
    {
        concurrency::LockGuard guard(&lock);
        Link *l = findLink(peer);
        outbound = l && l->outbound;
    }
    if (outbound) {
        if (!Bluefruit.Central.connected(peer))
            return false;
        // Write-without-response: a full command queue refuses now and the pump retries, where
        // write_resp would block the main task on every fragment.
        return meshClientCharacteristic.write(data, (uint16_t)len) == len;
    }
#endif
    // Bluefruit's notify blocks up to 100 ms waiting for a buffer, so a peer whose link is gone must be
    // refused here, not discovered by timing out fifty times on the main task.
    if (!Bluefruit.connected(peer))
        return false;
    return meshPeerCharacteristic.notify(peer, data, (uint16_t)len);
}

bool NRF52BLEGattMesh::platformProbe(BLEGattPeerId peer)
{
#if BLE_GATT_MESH_DIAL
    bool outbound = false;
    {
        concurrency::LockGuard guard(&lock);
        Link *l = findLink(peer);
        outbound = l && l->outbound;
    }
    if (!outbound)
        return true;
    if (!Bluefruit.Central.connected(peer))
        return false;
    // A write with response: the peer's ATT layer must answer, and a peer whose app died has no
    // handle left to answer for. The greeting is idempotent on the client, so it is the probe.
    uint8_t hello[BLE_GATT_MESH_HELLO_SIZE];
    const size_t len = buildHello(hello, sizeof(hello));
    ble_gattc_write_params_t params = {
        .write_op = BLE_GATT_OP_WRITE_REQ,
        .flags = 0,
        .handle = meshClientCharacteristic.valueHandle(),
        .offset = 0,
        .len = (uint16_t)len,
        .p_value = hello,
    };
    probeConn = peer;
    probeState = PROBE_PENDING;
    if (sd_ble_gattc_write(peer, &params) != NRF_SUCCESS) {
        probeState = PROBE_IDLE; // the stack is busy with another procedure; the retry will ask again
        return false;
    }
    // This runs on the main task; the response lands on the BLE task, and delay() yields to it.
    const uint32_t started = millis();
    while (probeState == PROBE_PENDING && Bluefruit.Central.connected(peer) &&
           Throttle::isWithinTimespanMs(started, BLE_GATT_MESH_PROBE_WAIT_MS))
        delay(10);
    const bool answered = probeState == PROBE_ANSWERED;
    probeState = PROBE_IDLE;
    probeConn = BLE_CONN_HANDLE_INVALID;
    return answered;
#else
    (void)peer;
    return true;
#endif
}

void NRF52BLEGattMesh::onWriteResponse(uint16_t conn, uint16_t status)
{
#if BLE_GATT_MESH_DIAL
    if (conn == probeConn && probeState == PROBE_PENDING)
        probeState = status == BLE_GATT_STATUS_SUCCESS ? PROBE_ANSWERED : PROBE_REFUSED;
#else
    (void)conn;
    (void)status;
#endif
}

void NRF52BLEGattMesh::onSecurityRequest(uint16_t conn)
{
#if BLE_GATT_MESH_DIAL
    // A phone bonded to this node's phone API asks the link be encrypted the moment it is dialled.
    // Bluefruit answers nothing on a central link, the phone's SMP timer runs out at 30 s and it drops
    // the link (0x05) - and declining is no better: Android drops a link whose security request is
    // refused within a second (measured 2026-09-19, 0x05 every dial). So encrypt it, with the key the
    // phone handed this node when it paired with the phone API. That pairing had this node as the
    // peripheral, so the bond lives in the peripheral store whatever role this link has, and the
    // key to start encryption with as the central is the one the phone distributed (peer_enc).
    // The mesh characteristic needs no encryption; this only keeps a bonded phone on the link.
    BLEConnection *c = Bluefruit.Connection(conn);
    if (!c || c->getRole() != BLE_GAP_ROLE_CENTRAL)
        return;
    ble_gap_addr_t addr = c->getPeerAddr(); // bond_load_keys resolves a private address by IRK itself
    bond_keys_t bkeys = {};
    if (bond_load_keys(BLE_GAP_ROLE_PERIPH, &addr, &bkeys) && bkeys.peer_enc.enc_info.ltk_len > 0) {
        const uint32_t err = sd_ble_gap_encrypt(conn, &bkeys.peer_enc.master_id, &bkeys.peer_enc.enc_info);
        LOG_INFO("BLE GATT mesh: encrypting dialled conn %u with its phone-API bond (0x%x)", conn, (unsigned)err);
        if (err == NRF_SUCCESS)
            return;
    }
    // No bond to honour: decline, which the SoftDevice does for a NULL parameter set.
    const uint32_t err = sd_ble_gap_authenticate(conn, NULL);
    LOG_INFO("BLE GATT mesh: declined the security request on dialled conn %u (0x%x)", conn, (unsigned)err);
#else
    (void)conn;
#endif
}

void NRF52BLEGattMesh::platformShedOutbound(BLEGattPeerId peer)
{
#if BLE_GATT_MESH_DIAL
    bool outbound = false;
    {
        concurrency::LockGuard guard(&lock);
        Link *l = findLink(peer);
        outbound = l && l->outbound;
    }
    if (!outbound)
        return;
    LOG_INFO("BLE GATT mesh: shedding dialled conn %u", peer);
    Bluefruit.disconnect(peer); // onCentralDisconnect arms the cooldown
#else
    (void)peer;
#endif
}

bool NRF52BLEGattMesh::platformPollInbound(BLEGattPeerId &peer, uint8_t *buf, size_t cap, size_t &len)
{
    concurrency::LockGuard guard(&lock);
    if (rxCount == 0)
        return false;
    const RxChunk &r = rxQueue[rxHead];
    peer = r.conn;
    len = std::min<size_t>(r.len, cap);
    if (len)
        memcpy(buf, r.data, len);
    rxHead = (rxHead + 1) % rxQueue.size();
    rxCount--;
    return true;
}

#endif // HAS_BLE_GATT_MESH && ARCH_NRF52
